{'contact_info': '', 'experience': 'Designed and developed applications using Scrum , an iterative and increm ental Agile Software Developm ent m ethodology.\nPerformed back-end development using PHP (CodeIgniter MVC Framework).\nDeveloped CMS like system majorly based on PHP and MYSQL.\nBuilt a fi l e-crawl er app i n CodeIgniter for sorting and rem oving duplicates and redundant files.\nCreated data entry form s in HTML em bedded with PHP.\nTrained in effectively utilizing agile m ethodologies and Object Oriented Program m ing practices.\nMaintained project docum entation.\nTrained in utilizing version control system  like Git and m anaging project tim eline by use of OpenERP, a com prehensive suite of business applications.\nResponsible for writing User and Adm inistrator Modules of PHP MySQL applications as per the technical specifications.\nResponsible for im plem enting and hosting of prototype system s on test servers.\nAttended seminars and workshops about SQL (Structured Query Language) and Database Design.', 'summary': 'Over 3 yearsÂ of experience serving as a key contributor across all software developm ent life cycleÂ phases includingÂ analysis, architectural design, prototyping, developm ent, and testing of applicationÂ using Java/J2EE technologies in various dom ains.\nVery good understanding of Object Oriented Program m ing, Data Structure, Algorithm s, Design Patterns and Distributed System s.\nExcellent working experience in backendÂ developm ent using different Spring m odules like Spring Core ContainerÂ Module, AOP, MVC, Security, Data, Transaction Managem ent etc.\nExperienced in developing Microservices with Spring Boot, Spring REST, Spring Cloud, etc.\nExtensive experience in developing Web interfaces using HTML5, CSS3, Bootstrap, SASS, LESS, JavaScript, jQuery, AngularJS, ReactJS and BackboneJS.\nExperienced in working with SQL databases like MySQL, PostgreSQL, Oracle and have som e knowledge of NoSQL databases like MongoDB.\nExpertise working in Agile m ethodology environm ents like Scrum .\nExperienced in working with Version Control Tools like SVN and Git.\nExperienced in perform ing autom ation using Selenium , Java and perform ing Behavioral driven testing using Cucum ber.\nExperienced in build tools like Ant, Maven, Gradle and using them  with continuous integration tools like Jenkins.\nA proactive learner with exceptional analytical, design and problem -solving capabilities.\nExcellent com m unication skills including form al presentations and technical docum entation.\nProductive in both team -based and self-m anaged projects.\nProgramming Languages: Java/J2EE, JavaScript, Android, HTML, CSS, SQL, C, C\nFrameworks and Libraries: Spring, Restful-Web Services, Hibernate, AngularJS, ReactJS, jQuery, Bootstrap,Â Selenium  WebDriver, Cucumber\nDatabases: MySQL, PostgreSQL, Oracle, MongoDB, H2\nBuild Tools: Gradle, Maven, Ant\nPractices: Agile/Scrum , Waterfall, TDD, Clean Coding, Continuous Delivery\nArchitectures: Microservices, Single Page Application, REST, Client/Server\nVersion Control: SVN, Git\nCloud Application Platform : AWS\nOthers: Bower, Grunt, Npm, Node, JSON, XML, Jenkins\nIDE: Eclipse, IntelliJ, Android Studio\nOperating Systems: Linux, Windows', 'skills': "SCBTIMS (Smart Card Based Trekkers' Information Management System).\nWas responsible for writing core software logic for QMS (Queue Managem ent System ) in Java, developing plugin architecture and i m pl em enti n g  RS485, TCP & HTTP channels as plugins for interfacing QMS hardware devices.\nWorked as a development coordinator for projects like VMS (Visitors Managem ent System ), QMS (Queue Managem ent System ), SCBTIMS (Smart Card Based Trekkers' Information Management System).\nWorked with JS, JSP, HTML, CSS, Bootstrap, AngularJS and ReactJS to design and develop interactive user interfaces and HMI (Hum an Machine Interface) for real-tim e data m onitoring and interactions.\nBuilt m ulti pl e m obi l e appl i cati on s (Androi d and i OS) f or real -ti m e m oni tori ng of  hydrol ogi c param eters and al ert di ssem i nati on duri ng f l oods and glacial lake outburst risks.\nGained experience in m ulti-platform  m obile application developm ent technologies like PhoneGap and Titanium .\nFixed bugs and im plem ented im provem ent features using Java and J2EE on large scale projects through reviews of codes and test cases, analysis of change requests and enhancem ents, investing alternate configurations and im plem enting better solutions.\nLeveraged an array of tools to optim ize efficiency, including OpenERP for project m anagem ent, Git for source control and versioning, sophisticated IDEs such as IntelliJ and m any other.\nWas responsible for client interactions and handling technical aspects in a sales pitch.", 'education': "Master of Science : Com puter Science 2017 Lam ar University City , State , United States of Am erica GPA: 4.0/4.0 Bachelor of Engineering : Electronics and Com m unication Engineering 2013 Tribhuvan University City , State , Nepal GPA: 3.94/4.0 Honours and Distinction\nWinner of National Robotics Com petition, 'Yantra 1.0' organized by Robotics Association of Nepal (RAN): July 2012\nOutstanding Student Award, Lamar University: Fall 2017Â", 'other': 'Website: www.sagunpandey.com\nLinkedIn: www.linkedin.com /in/sagunpandey\nGitHub: www.github.com/sagunpandey'}